[{ "_id": 123,
  "topic": "Web Development",
  "userName": "ReactJS",
  "title": "React.js is a component based front end library that makes it very easy to build a Single Page Applications or SPAs",
  "time": " - 2h",
  "image": "react.png",
  "tweets": "",
  "liked": true,
  "replies": 112,
  "retuits": 237,
  "likes": 324,
  "handle": "@reactJS",
  "tuit": "One of the most common problems that I run into when using Redux is trying to figure out why an action is not being captured by a reducer. For someone just getting starting with Redux, debugging this issue can be especially overwhelming because of how Redux manages data flow. So before you start pouring over configuration code, or the logic contained in your action creators and reducers, please, make sure your action types are defined and spelled correctly."},

  { "_id": 124,
    "topic": "",
    "userName": "JavaScript",
    "title": "JavaScript is a programming lenguage that can run on browsers as well as desktops",
    "time": " - 3d",
    "image": "js.png",
    "tweets": "123K Tweets",
    "liked": false,
    "replies": 129,
    "retuits": 298,
    "likes": 614,
    "handle": "@javascript",
    "tuit":"The average web page is about 2 megabytes, according to HTTP Archive, a site that tracks the performance of websites and the technologies they use. Sure you can download 2 megabytes in less than a second on a good 4G mobile connection. But today’s web pages are problematic for people on slow connections or with small bandwidth caps. Not all that long ago, a complex game or software program fit on a 1.4-megabyte floppy disk."},

  { "_id": 125,
    "topic": "Web Development",
    "userName": "JQuery",
    "title": "",
    "time": "",
    "image": "jquery.png",
    "tweets": "123K Tweets",
    "liked": false,
    "replies": 210,
    "retuits": 115,
    "likes": 414,
    "handle": "@jQuery",
    "tuit":"jQuery 3.6.1 has been released! It’s been a while since our previous release. We were looking at fixing some elusive edge cases related to focus and blur, but we never quite got the fix right. If there’s any area of jQuery that’s hard to change, it’s likely related to focus somehow."},

  { "_id": 126,
    "topic": "Web Development",
    "userName": "NodeJS",
    "title": "",
    "time": " - 1w",
    "image": "nodejs.png",
    "tweets": "123K Tweets",
    "liked": true,
    "replies": 410,
    "retuits": 219,
    "likes": 294,
    "handle": "@jQuery",
    "tuit":"This project really is a culmination of 4 years of work trying to make the best library for web scraping in production. Web scraping is a very dynamic environment and what works today might not work tomorrow, so we at Apify had to go through a lot of trial and error to figure out the most reliable and convenient ways of crawling the web and scraping data."}]


